fonecmid-diplom/src/Documents/РеализацияТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РеализацияТоваровУслуг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
				<xr:Item>AccumulationRegister.ОбработкаЗаказов</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.РеализацияТоваровУслуг) Тогда
		
        КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
        КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.РеализацияТоваровУслуг.ПолноеИмя();
        КомандаСоздатьНаОсновании.Представление = ОбщегоНазначения.ПредставлениеОбъекта(Метаданные.Документы.РеализацияТоваровУслуг);
        КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

// Гумерова ГР 23.02.2026 Реализация возможности печати акта об оказании работ (услуг). Функция формирует табличный документ, который потом можно показать  

Функция ПечатьАкта(СсылкаНаДокумент) Экспорт
	
	// 1. Получаем макет
	Макет = Документы.РеализацияТоваровУслуг.ПолучитьМакет("ПФ_MXL_Акт");
	
	// 2. Создаем запрос за данными
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Док.Номер КАК Номер,
		|	Док.Дата КАК Дата,
		|	Док.Организация КАК Организация,
		|	Док.Контрагент КАК Контрагент,
		|	Док.Договор КАК Договор,
		|	Док.СуммаДокумента КАК ИтоговаяСумма,
		|	Док.Услуги.(
		|		НомерСтроки КАК НомерСтроки,
		|		Номенклатура КАК Номенклатура,
		|		Количество КАК Количество,
		|		Цена КАК Цена,
		|		Сумма КАК Сумма
		|	) КАК ТаблицаУслуг
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК Док
		|ГДЕ
		|	Док.Ссылка = &Ссылка";
		
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	
	// Выполняем запрос
	Результат = Запрос.Выполнить();
	
	// Если документа вдруг нет (удалили в процессе), возвращаем пустой табдок
	Если Результат.Пустой() Тогда
		Возврат Новый ТабличныйДокумент;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	Выборка.Следующий(); // Позиционируемся на шапке документа
	
	// 3. Создаем и заполняем Табличный документ
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.АвтоМасштаб = Истина; // Чтобы влезало на лист А4
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	
	// --- Вывод Заголовка ---
	Область = Макет.ПолучитьОбласть("Заголовок");
	// Заполняем параметры. Так как имена в макете [Номер] и [Дата] совпадают с полями запроса,
	// можно использовать Заполнить(), но дата будет со временем.
	// Лучше вручную для красивого формата:
	Область.Параметры.Номер = Выборка.Номер;
	Область.Параметры.Дата  = Формат(Выборка.Дата, "ДЛФ=DD"); // "20 января 2024 г."
	ТабДок.Вывести(Область);
	
	// --- Вывод Шапки (Организация, Клиент) ---
	Область = Макет.ПолучитьОбласть("Шапка");
	Область.Параметры.Заполнить(Выборка); 
	// В макете параметры должны называться "Организация", "Контрагент", "Договор"
	ТабДок.Вывести(Область);
	
	// --- Вывод Шапки таблицы ---
	Область = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДок.Вывести(Область);
	
	// --- Вывод Строк (Цикл) ---
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ВыборкаСтрок = Выборка.ТаблицаУслуг.Выбрать();
	
	Пока ВыборкаСтрок.Следующий() Цикл
		// Заполняем параметры строки (НомерСтроки, Номенклатура, Количество и т.д.)
		ОбластьСтрока.Параметры.Заполнить(ВыборкаСтрок);
		ТабДок.Вывести(ОбластьСтрока);
	КонецЦикла;
	
	// --- Вывод Итого ---
	Область = Макет.ПолучитьОбласть("Итого");
	Область.Параметры.ВсегоСумма = Выборка.ИтоговаяСумма;
	ТабДок.Вывести(Область);
	
	// --- Вывод Подвала ---
	Область = Макет.ПолучитьОбласть("Подвал");
	
	// Формируем сумму прописью
	// Параметры: Число, ФорматнаяСтрока (Код языка), Параметры предмета исчисления
	СуммаПрописьюТекст = ЧислоПрописью(Выборка.ИтоговаяСумма, "L=ru_RU", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
	
	// Делаем первую букву заглавной
	СуммаПрописьюТекст = ТРег(Лев(СуммаПрописьюТекст, 1)) + Сред(СуммаПрописьюТекст, 2);
	
	Область.Параметры.СуммаПрописью = СуммаПрописьюТекст;
	
	ТабДок.Вывести(Область);
	
	// 4. Реализация возможности редактирования (по заданию)
	ТабДок.ТолькоПросмотр = Ложь; // Пользователь сможет кликнуть в ячейку и поменять текст
	ТабДок.Защита = Ложь;
	
	Возврат ТабДок;
	
КонецФункции    

// Гумерова ГР 23.02.2026

#КонецОбласти

#КонецЕсли
